RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_adc.c
/*!
 * @file        apm32f4xx_adc.c
 *
 * @brief       This file contains all the functions for the ADC peripheral
 *
 * @version     V1.0.2
 *
 * @date        2022-06-23
 *
 * @attention
 *
 *  Copyright (C) 2021-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32f4xx_adc.h"
#include "apm32f4xx_rcm.h"

/** @addtogroup APM32F4xx_StdPeriphDriver
  @{
*/

/** @defgroup ADC_Driver
  * @brief ADC driver modules
  @{
*/

/** @defgroup ADC_Functions
  @{
*/

/*!
 * @brief     Reset ADC peripheral registers to their default reset values.
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_Reset(void)
{
    RCM_EnableAPB2PeriphReset(RCM_APB2_PERIPH_ADC);
    RCM_DisableAPB2PeriphReset(RCM_APB2_PERIPH_ADC);
}

/*!
 * @brief     Config the ADC peripheral according to the specified parameters in the adcConfig.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     adcConfig: pointer to a ADC_Config_T structure.
 *
 * @retval    None
 */
void ADC_Config(ADC_T *adc, ADC_Config_T *adcConfig)
{
    adc->CTRL1_B.RESSEL = adcConfig->resolution;
    adc->CTRL1_B.SCANEN = adcConfig->scanConvMode;

    adc->CTRL2_B.REGEXTTRGEN = adcConfig->extTrigEdge;
    adc->CTRL2_B.REGEXTTRGSEL = adcConfig->extTrigConv;
    adc->CTRL2_B.DALIGNCFG = adcConfig->dataAlign;
    adc->CTRL2_B.CONTCEN = adcConfig->continuousConvMode;

    adc->REGSEQ1_B.REGSEQLEN = adcConfig->nbrOfChannel - 1;
}

/*!
 * @brief     Fills each ADC_Config_T member with its default value.
 *
 * @param     adcConfig: pointer to an ADC_Config_T structure.
 *
 * @retval    None
 */
void ADC_ConfigStructInit(ADC_Config_T *adcConfig)
{
    adcConfig->resolution = ADC_RESOLUTION_12BIT;
    adcConfig->scanConvMode = DISABLE;
    adcConfig->continuousConvMode = DISABLE;
    adcConfig->extTrigEdge = ADC_EXT_TRIG_EDGE_NONE;
    adcConfig->extTrigConv = ADC_EXT_TRIG_CONV_TMR1_CC1;
    adcConfig->dataAlign = ADC_DATA_ALIGN_RIGHT;
    adcConfig->nbrOfChannel = 1;
}

/*!
 * @brief     Config the ADCs peripherals according to the specified parameters in
 *             the adcCommonConfig.
 *
 * @param     adcCommonConfig: pointer to an ADC_CommonConfig_T structure
 *
 * @retval    None
 */
void ADC_CommonConfig(ADC_CommonConfig_T *adcCommonConfig)
{
    ADC->CCTRL_B.ADCMSEL = adcCommonConfig->mode;
    ADC->CCTRL_B.ADCPRE = adcCommonConfig->prescaler;
    ADC->CCTRL_B.DMAMODE = adcCommonConfig->accessMode;
    ADC->CCTRL_B.SMPDEL2 = adcCommonConfig->twoSampling;
}

/*!
 * @brief     Fills each ADC_CommonInitStruct member with its default value.
 *
 * @param     adccommonconfig: pointer to an ADC_CommonInitTypeDef structure.
 *
 * @retval    None
 */
void ADC_CommonConfigStructInit(ADC_CommonConfig_T *adccommonconfig)
{
    adccommonconfig->mode = ADC_MODE_INDEPENDENT;
    adccommonconfig->prescaler = ADC_PRESCALER_DIV2;
    adccommonconfig->accessMode = ADC_ACCESS_MODE_DISABLED;
    adccommonconfig->twoSampling = ADC_TWO_SAMPLING_5CYCLES;
}

/*!
 * @brief     Enables the specified ADC peripheral.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_Enable(ADC_T *adc)
{
    adc->CTRL2_B.ADCEN = BIT_SET;
}

/*!
 * @brief     Disable the specified ADC peripheral.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_Disable(ADC_T *adc)
{
    adc->CTRL2_B.ADCEN = BIT_RESET;
}

/*!
 * @brief     Enable the specified ADC analog watchdog.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     analogWatchdog: The ADC analog watchdog configuration
 *               This parameter can be one of the following values:
 *               @arg ADC_ANALOG_WATCHDOG_SINGLE_REG        : Analog watchdog on a single regular channel
 *               @arg ADC_ANALOG_WATCHDOG_SINGLE_INJEC      : Analog watchdog on a single injected channel
 *               @arg ADC_ANALOG_WATCHDOG_SINGLE_REG_INJEC  : Analog watchdog on a single regular or injected channel
 *               @arg ADC_ANALOG_WATCHDOG_ALL_REG           : Analog watchdog on  all regular channel
 *               @arg ADC_ANALOG_WATCHDOG_ALL_INJEC         : Analog watchdog on  all injected channel
 *               @arg ADC_ANALOG_WATCHDOG_ALL_REG_ALL_INJEC : Analog watchdog on all regular and injected channels
 *
 * @retval    None
 */
void ADC_EnableAnalogWatchdog(ADC_T *adc, ADC_ANALOG_WATCHDOG_T analogWatchdog)
{
    adc->CTRL1_B.INJAWDEN = analogWatchdog & 0x01;
    adc->CTRL1_B.REGAWDEN = (analogWatchdog >> 1) & 0x01;
    adc->CTRL1_B.AWDSGLEN = analogWatchdog >> 4;
}

/*!
 * @brief     Disable the specified ADC analog watchdog.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_DisableAnalogWatchdog(ADC_T *adc)
{
    adc->CTRL1_B.AWDSGLEN = BIT_RESET;
    adc->CTRL1_B.INJAWDEN = BIT_RESET;
    adc->CTRL1_B.REGAWDEN = BIT_RESET;
}

/*!
 * @brief     Configures the specified ADC high and low thresholds of the analog watchdog.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     highThreshold: The ADC analog watchdog High threshold value.
 *                           This parameter must be a 12bit value.
 *
 * @param     lowThreshold:  The ADC analog watchdog Low threshold value.
 *                           This parameter must be a 12bit value.
 * @retval    None
 */
void ADC_ConfigAnalogWatchdogThresholds(ADC_T *adc, uint16_t highThreshold, uint16_t lowThreshold)
{
    adc->AWDHT = highThreshold;
    adc->AWDLT = lowThreshold;
}

/*!
 * @brief     Configures the specified ADC high and low thresholds of the analog watchdog.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     lowThreshold: The ADC analog watchdog Low threshold value.
 *                          This parameter must be a 12bit value.
 *
 * @retval    None
 */
void ADC_AnalogWatchdogLowThresholds(ADC_T *adc,  uint16_t lowThreshold)
{
    adc->AWDLT = lowThreshold;
}

/*!
 * @brief      Configures the specified ADC analog watchdog guarded single channel
 *
 * @param      adc: Select the ADC peripheral
 *
 * @param      channel: Select the ADC channel
 *                      This parameter can be one of the following values:
 *                        @arg ADC_CHANNEL_0:   Select ADC Channel 0
 *                        @arg ADC_CHANNEL_1:   Select ADC Channel 1
 *                        @arg ADC_CHANNEL_2:   Select ADC Channel 2
 *                        @arg ADC_CHANNEL_3:   Select ADC Channel 3
 *                        @arg ADC_CHANNEL_4:   Select ADC Channel 4
 *                        @arg ADC_CHANNEL_5:   Select ADC Channel 5
 *                        @arg ADC_CHANNEL_6:   Select ADC Channel 6
 *                        @arg ADC_CHANNEL_7:   Select ADC Channel 7
 *                        @arg ADC_CHANNEL_8:   Select ADC Channel 8
 *                        @arg ADC_CHANNEL_9:   Select ADC Channel 9
 *                        @arg ADC_CHANNEL_10:  Select ADC Channel 10
 *                        @arg ADC_CHANNEL_11:  Select ADC Channel 11
 *                        @arg ADC_CHANNEL_12:  Select ADC Channel 12
 *                        @arg ADC_CHANNEL_13:  Select ADC Channel 13
 *                        @arg ADC_CHANNEL_14:  Select ADC Channel 14
 *                        @arg ADC_CHANNEL_15:  Select ADC Channel 15
 *                        @arg ADC_CHANNEL_16:  Select ADC Channel 16
 *                        @arg ADC_CHANNEL_17:  Select ADC Channel 17
 *                        @arg ADC_CHANNEL_18:  Select ADC Channel 18
 *
 * @retval     None
 *
 * @note       adc can be ADC1, ADC2 or ADC3.
 */
void ADC_ConfigAnalogWatchdogSingleChannel(ADC_T *adc, uint8_t channel)
{
    adc->CTRL1_B.AWDCHSEL = channel;
}

/*!
 * @brief     Enables the temperature sensor and Vrefint channels.
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_EnableTempSensorVrefint(void)
{
    ADC->CCTRL_B.TSVREFEN = BIT_SET;
}

/*!
 * @brief     Disable the temperature sensor and Vrefint channel.
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_DisableTempSensorVrefint(void)
{
    ADC->CCTRL_B.TSVREFEN = BIT_RESET;
}

/*!
 * @brief     Enables  the VBAT (Voltage Battery) channel.
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_EnableVbat(void)
{
    ADC->CCTRL_B.VBATEN = BIT_SET;
}

/*!
 * @brief     Disables the VBAT (Voltage Battery) channel.
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_DisableVbat(void)
{
    ADC->CCTRL_B.VBATEN = BIT_RESET;
}

/*!
 * @brief     Configures the specified ADC regular channel.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     channel: the ADC channel to configure.
 *                     This parameter can be one of the following values:
 *                     @arg ADC_CHANNEL_0:  ADC channel 0
 *                     @arg ADC_CHANNEL_1:  ADC channel 1
 *                     @arg ADC_CHANNEL_2:  ADC channel 2
 *                     @arg ADC_CHANNEL_3:  ADC channel 3
 *                     @arg ADC_CHANNEL_4:  ADC channel 4
 *                     @arg ADC_CHANNEL_5:  ADC channel 5
 *                     @arg ADC_CHANNEL_6:  ADC channel 6
 *                     @arg ADC_CHANNEL_7:  ADC channel 7
 *                     @arg ADC_CHANNEL_8:  ADC channel 8
 *                     @arg ADC_CHANNEL_9:  ADC channel 9
 *                     @arg ADC_CHANNEL_10: ADC channel 10
 *                     @arg ADC_CHANNEL_11: ADC channel 11
 *                     @arg ADC_CHANNEL_12: ADC channel 12
 *                     @arg ADC_CHANNEL_13: ADC channel 13
 *                     @arg ADC_CHANNEL_14: ADC channel 14
 *                     @arg ADC_CHANNEL_15: ADC channel 15
 *                     @arg ADC_CHANNEL_16: ADC channel 16
 *                     @arg ADC_CHANNEL_17: ADC channel 17
 *                     @arg ADC_CHANNEL_18: ADC Channel 18
 *
 * @param     rank: The rank in the regular group sequencer
 *                     This parameter must be between 1 to 16.
 *
 * @param     sampleTime: the specified ADC channel SampleTime
 *                     The parameter can be one of following values:
 *                     @arg ADC_SAMPLETIME_3CYCLES:   Sample time equal to 3 cycles
 *                     @arg ADC_SAMPLETIME_15CYCLES:  Sample time equal to 15 cycles
 *                     @arg ADC_SAMPLETIME_28CYCLES:  Sample time equal to 28 cycles
 *                     @arg ADC_SAMPLETIME_56CYCLES:  Sample time equal to 56 cycles
 *                     @arg ADC_SAMPLETIME_84CYCLES:  Sample time equal to 84 cycles
 *                     @arg ADC_SAMPLETIME_112CYCLES: Sample time equal to 112 cycles
 *                     @arg ADC_SAMPLETIME_144CYCLES: Sample time equal to 144 cycles
 *                     @arg ADC_SAMPLETIME_480CYCLES: Sample time equal to 480 cycles
 *
 * @retval None
 */

void ADC_ConfigRegularChannel(ADC_T *adc, uint8_t channel, uint8_t rank, uint8_t sampleTime)
{
    uint32_t temp1 = 0;
    uint32_t temp2 = 0;

