RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_adc.c
    if (channel > ADC_CHANNEL_9)
    {
        temp1 = adc->SMPTIM1;
        temp2 = (uint32_t)7 << (3 * (channel - 10));
        temp1 &= ~temp2;
        temp2 = (uint32_t)sampleTime << (3 * (channel - 10));
        temp1 |= temp2;
        adc->SMPTIM1 = temp1;
    }
    else
    {
        temp1 = adc->SMPTIM2;
        temp2 = (uint32_t)7 << (3 * channel);
        temp1 &= ~temp2;
        temp2 = (uint32_t)sampleTime << (3 * channel);
        temp1 |= temp2;
        adc->SMPTIM2 = temp1;
    }

    if (rank < 7)
    {
        temp1 = adc->REGSEQ3;
        temp2 = (uint32_t)0x1F << (5 * (rank - 1));
        temp1 &= ~temp2;
        temp2 = (uint32_t)channel << (5 * (rank - 1));
        temp1 |= temp2;
        adc->REGSEQ3 = temp1;
    }
    else if (rank < 13)
    {
        temp1 = adc->REGSEQ2;
        temp2 = (uint32_t)0x1F << (5 * (rank - 7));
        temp1 &= ~temp2;
        temp2 = (uint32_t)channel << (5 * (rank - 7));
        temp1 |= temp2;
        adc->REGSEQ2 = temp1;
    }
    else
    {
        temp1 = adc->REGSEQ1;
        temp2 = (uint32_t)0x1F << (5 * (rank - 13));
        temp1 &= ~temp2;
        temp2 = (uint32_t)channel << (5 * (rank - 13));
        temp1 |= temp2;
        adc->REGSEQ1 = temp1;
    }
}

/*!
 * @brief     Enables the selected ADC software start conversion of the regular channels.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_SoftwareStartConv(ADC_T *adc)
{
    adc->CTRL2_B.REGCHSC = BIT_SET;
}

/*!
 * @brief     Reads the selected ADC Software start regular conversion Status.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The new state of ADC software start conversion (SET or RESET).
 */
uint8_t ADC_ReadSoftwareStartConvStatus(ADC_T *adc)
{
    return (uint8_t)adc->CTRL2_B.REGCHSC;
}

/**
 * @brief     Enables the EOC on each regular channel conversion
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_EnableEOCOnEachChannel(ADC_T *adc)
{
    adc->CTRL2_B.EOCSEL = BIT_SET;

}

/**
 * @brief     Disables the EOC on each regular channel conversion
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_DisableEOCOnEachChannel(ADC_T *adc)
{
    adc->CTRL2_B.EOCSEL = BIT_RESET;
}

/*!
 * @brief     Enables the ADC continuous conversion mode
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_EnableContinuousMode(ADC_T *adc)
{
    adc->CTRL2_B.CONTCEN = BIT_SET;
}

/*!
 * @brief     Disables the ADC continuous conversion mode
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_DisableContinuousMode(ADC_T *adc)
{
    adc->CTRL2_B.CONTCEN = BIT_RESET;;
}

/*!
 * @brief     Configures the discontinuous mode for the selected ADC regular group
 *            channel.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     number: specifies the discontinuous mode regular channel count value.
 *                    This number must be between 1 and 8.
 *
 * @retval    None
 */
void ADC_ConfigDiscMode(ADC_T *adc, uint8_t number)
{
    adc->CTRL1_B.DISCNUMCFG = number - 1;
}

/*!
 * @brief     Enables the discontinuous mode on regular group channel.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_EnableDiscMode(ADC_T *adc)
{
    adc->CTRL1_B.REGDISCEN = BIT_SET;
}

/*!
 * @brief     Disables the discontinuous mode for injected group channel.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_DisableDiscMode(ADC_T *adc)
{
    adc->CTRL1_B.REGDISCEN = BIT_RESET;
}

/*!
 * @brief     Reads the specified ADC conversion result data.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The Data conversion value.
 */
uint16_t ADC_ReadConversionValue(ADC_T *adc)
{
    return (uint16_t) adc->REGDATA;
}

/*!
 * @brief     Reads the specified ADC conversion result data in dual mode.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The Data conversion value.
 *            - In dual mode:
 *                Data[15:0] contain the regular data of ADC1.
 *                Data[31:16] contain the regular data of ADC2.
 *            - In triple mode:
 *                Data[15:0] contain alternatively the regular data of ADC1, ADC3 and ADC2.
 *                Data[31:16] contain alternatively the regular data of ADC2, ADC1 and ADC3.
 */
uint32_t ADC_ReadMultiValue(void)
{
    return ADC->CDATA;
}

/*!
 * @brief     Enables the specified ADC DMA request.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The Data conversion value.
 */
void ADC_EnableDMA(ADC_T *adc)
{
    adc->CTRL2_B.DMAEN = BIT_SET;
}

/*!
 * @brief     Disables the specified ADC DMA request.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The Data conversion value.
 */
void ADC_DisableDMA(ADC_T *adc)
{
    adc->CTRL2_B.DMAEN = BIT_RESET;
}
/*!
 * @brief     Enables  the ADC DMA request after last transfer (Single-ADC mode)
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The Data conversion value.
 */
void ADC_EnableDMARequest(ADC_T *adc)
{
    adc->CTRL2_B.DMADISSEL = BIT_SET;
}
/*!
 * @brief     Disables  the ADC DMA request after last transfer (Single-ADC mode)
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    The Data conversion value.
 */
void ADC_DisableDMARequest(ADC_T *adc)
{
    adc->CTRL2_B.DMADISSEL = BIT_RESET;
}

/*!
 * @brief     Enables the ADC DMA request after last transfer in multi ADC mode
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_EnableMultiModeDMARequest(void)
{
    ADC->CCTRL_B.DMADISSEL = BIT_SET;
}

/*!
 * @brief     Disables the ADC DMA request after last transfer in multi ADC mode
 *
 * @param     None
 *
 * @retval    None
 */
void ADC_DisableMultiModeDMARequest(void)
{
    ADC->CCTRL_B.DMADISSEL = BIT_RESET;
}

/*!
 * @brief     Configures the specified ADC injected channel.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     channel: the ADC channel to configure.
 *                    This parameter can be one of the following values:
 *                    @arg ADC_CHANNEL_0:  ADC channel 0
 *                    @arg ADC_CHANNEL_1:  ADC channel 1
 *                    @arg ADC_CHANNEL_2:  ADC channel 2
 *                    @arg ADC_CHANNEL_3:  ADC channel 3
 *                    @arg ADC_CHANNEL_4:  ADC channel 4
 *                    @arg ADC_CHANNEL_5:  ADC channel 5
 *                    @arg ADC_CHANNEL_6:  ADC channel 6
 *                    @arg ADC_CHANNEL_7:  ADC channel 7
 *                    @arg ADC_CHANNEL_8:  ADC channel 8
 *                    @arg ADC_CHANNEL_9:  ADC channel 9
 *                    @arg ADC_CHANNEL_10: ADC channel 10
 *                    @arg ADC_CHANNEL_11: ADC channel 11
 *                    @arg ADC_CHANNEL_12: ADC channel 12
 *                    @arg ADC_CHANNEL_13: ADC channel 13
 *                    @arg ADC_CHANNEL_14: ADC channel 14
 *                    @arg ADC_CHANNEL_15: ADC channel 15
 *                    @arg ADC_CHANNEL_16: ADC channel 16
 *                    @arg ADC_CHANNEL_17: ADC channel 17
 *                    @arg ADC_CHANNEL_18: ADC Channel 18
 *
 * @param     rank: The rank in the regular group sequencer
 *                     This parameter must be between 1 to 16.
 *
 * @param     sampleTime: the specified ADC channel SampleTime
 *                     The parameter can be one of following values:
 *                     @arg ADC_SAMPLETIME_3CYCLES:   Sample time equal to 3 cycles
 *                     @arg ADC_SAMPLETIME_15CYCLES:  Sample time equal to 15 cycles
 *                     @arg ADC_SAMPLETIME_28CYCLES:  Sample time equal to 28 cycles
 *                     @arg ADC_SAMPLETIME_56CYCLES:  Sample time equal to 56 cycles
 *                     @arg ADC_SAMPLETIME_84CYCLES:  Sample time equal to 84 cycles
 *                     @arg ADC_SAMPLETIME_112CYCLES: Sample time equal to 112 cycles
 *                     @arg ADC_SAMPLETIME_144CYCLES: Sample time equal to 144 cycles
 *                     @arg ADC_SAMPLETIME_480CYCLES: Sample time equal to 480 cycles
 *
 * @retval    None
 */

void ADC_ConfigInjectedChannel(ADC_T *adc, uint8_t channel, uint8_t rank, uint8_t sampleTime)
{
    uint32_t temp1 = 0;
    uint32_t temp2 = 0;

