RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_adc.c
    if (channel > ADC_CHANNEL_9)
    {
        temp1 = adc->SMPTIM1;
        temp2 = (uint32_t)7 << (3 * (channel - 10));
        temp1 &= ~temp2;
        temp2 = (uint32_t)sampleTime << (3 * (channel - 10));
        temp1 |= temp2;
        adc->SMPTIM1 = temp1;
    }
    else
    {
        temp1 = adc->SMPTIM2;
        temp2 = (uint32_t)7 << (3 * channel);
        temp1 &= ~temp2;
        temp2 = (uint32_t)sampleTime << (3 * channel);
        temp1 |= temp2;
        adc->SMPTIM2 = temp1;
    }

    temp1 = adc->INJSEQ;
    temp2 = (uint32_t)0x1F << (5 * ((rank + 3) - (adc->INJSEQ_B.INJSEQLEN + 1)));
    temp1 &= ~temp2;
    temp2 = (uint32_t)channel << (5 * ((rank + 3) - (adc->INJSEQ_B.INJSEQLEN + 1)));
    temp1 |= temp2;
    adc->INJSEQ = temp1;
}

/*!
 * @brief     Configures the sequencer length for injected channels
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     length: The sequencer length.
 *                    This parameter must be a number between 1 to 4.
 *
 * @retval    None
 */
void ADC_ConfigInjectedSequencerLength(ADC_T *adc, uint8_t length)
{
    adc->INJSEQ_B.INJSEQLEN = length - 1;
}

/*!
 * @brief     Configures the specified ADC injected channel conversion value offset.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     channel: Select the ADC injected channel.
 *                     This parameter can be one of the following values:
 *                     @arg ADC_INJEC_CHANNEL_1: select Injected Channel 1
 *                     @arg ADC_INJEC_CHANNEL_2: select Injected Channel 2
 *                     @arg ADC_INJEC_CHANNEL_3: select Injected Channel 3
 *                     @arg ADC_INJEC_CHANNEL_4: select Injected Channel 4
 *
 * @param     offset: The specified ADC injected channel offset.
 *                    This parameter must be a 12bit value.
 *
 * @retval    None
 */
void ADC_ConfigInjectedOffset(ADC_T *adc, ADC_INJEC_CHANNEL_T channel, uint16_t offset)
{
    switch ((uint8_t)channel)
    {
    case 0x01:
        adc->INJDOF1_B.INJDOF1 = offset;
        break;
    case 0x02:
        adc->INJDOF2_B.INJDOF2 = offset;
        break;
    case 0x03:
        adc->INJDOF3_B.INJDOF3 = offset;
        break;
    case 0x04:
        adc->INJDOF4_B.INJDOF4 = offset;
        break;
    default :
        break;
    }
}

/*!
 * @brief     Configures the specified ADC external trigger for injected channels conversion
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     extTrigInjecConv: Select the ADC trigger to start injected conversion
 *                 This parameter can be one of the following values:
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR1_CC4:  Timer1 capture compare4 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR1_TRGO: Timer1 TRGO event selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR2_CC1:  Timer2 capture compare1 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR2_TRGO: Timer2 TRGO event selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR3_CC2:  Timer3 capture compare2 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR3_CC4:  Timer3 capture compare4 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR4_CC1:  Timer4 capture compare1 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR4_CC2:  Timer4 capture compare2 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR4_CC3:  Timer4 capture compare3 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR4_TRGO: Timer4 TRGO event selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR5_CC4:  Timer5 capture compare4 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR5_TRGO: Timer5 TRGO event selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR8_CC2:  Timer8 capture compare2 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR8_CC3:  Timer8 capture compare3 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_TMR8_CC4:  Timer8 capture compare4 selected
 *                 @arg ADC_EXT_TRIG_INJEC_CONV_EINT15: External interrupt line 15 event selected
 *
 * @retval    None
 */
void ADC_ConfigExternalTrigInjectedConv(ADC_T *adc, ADC_EXT_TRIG_INJEC_CONV_T extTrigInjecConv)
{
    adc->CTRL2_B.INJGEXTTRGSEL = extTrigInjecConv;
}
/*!
 * @brief     Configures the ADCx external trigger edge for injected channels conversion.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     extTrigInjecConvEdge: Select the ADC trigger to start injected conversion
 *                 This parameter can be one of the following values:
 *                 @arg ADC_EXT_TRIG_INJEC_EDGE_NONE          :external trigger disabled for injected conversion
 *                 @arg ADC_EXT_TRIG_INJEC_EDGE_RISING        :detection on rising edge
 *                 @arg ADC_EXT_TRIG_INJEC_EDGE_FALLING       :detection on falling edge
 *                 @arg ADC_EXT_TRIG_INJEC_EDGE_RISING_FALLING:detection on both rising and falling edge
 *
 * @retval    None
 */
void ADC_ConfigExternalTrigInjectedConvEdge(ADC_T *adc, ADC_EXT_TRIG_INJEC_EDGE_T extTrigInjecConvEdge)
{
    adc->CTRL2_B.INJEXTTRGEN = extTrigInjecConvEdge;
}

/*!
 * @brief     Enables the selected ADC software start conversion of the injected channels.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_EnableSoftwareStartInjectedConv(ADC_T *adc)
{
    adc->CTRL2_B.INJCHSC = BIT_SET;
}

/*!
 * @brief     Reads the selected ADC Software start injected conversion Status.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
uint8_t ADC_ReadSoftwareStartInjectedConvStatus(ADC_T *adc)
{
    return (uint8_t)(adc->CTRL2_B.INJCHSC);
}

/*!
 * @brief     Enables the selected ADC automatic injected group conversion after regular one.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_EnableAutoInjectedConv(ADC_T *adc)
{
    adc->CTRL1_B.INJGACEN = BIT_SET;
}

/*!
 * @brief     Disables the selected ADC automatic injected group conversion after regular one.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_DisableAutoInjectedConv(ADC_T *adc)
{
    adc->CTRL1_B.INJGACEN = BIT_RESET;
}

/*!
 * @brief     Enable the specified ADC discontinuous mode for injected group.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_EnableInjectedDiscMode(ADC_T *adc)
{
    adc->CTRL1_B.INJDISCEN = BIT_SET;
}

/*!
 * @brief     Disable the specified ADC discontinuous mode for injected group.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @retval    None
 */
void ADC_DisableInjectedDiscMode(ADC_T *adc)
{
    adc->CTRL1_B.INJDISCEN = BIT_RESET;
}

/*!
 * @brief     Reads the ADC injected channel conversion result
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     channel: the converted ADC injected channel.
 *               This parameter can be one of the following values:
 *               @arg ADC_INJEC_CHANNEL_1: Injected Channel1 selected
 *               @arg ADC_INJEC_CHANNEL_2: Injected Channel2 selected
 *               @arg ADC_INJEC_CHANNEL_3: Injected Channel3 selected
 *               @arg ADC_INJEC_CHANNEL_4: Injected Channel4 selected
 *
 * @retval    The Data conversion value.
 */
uint16_t ADC_ReadInjectedConversionValue(ADC_T *adc, ADC_INJEC_CHANNEL_T channel)
{
    switch ((uint8_t)channel)
    {
    case 0x01:
        return (uint16_t)adc->INJDATA1_B.INJDATA;
    case 0x02:
        return (uint16_t)adc->INJDATA2_B.INJDATA;
    case 0x03:
        return (uint16_t)adc->INJDATA3_B.INJDATA;
    case 0x04:
        return (uint16_t)adc->INJDATA4_B.INJDATA;
    default :
        return 0;
    }
}

/*!
 * @brief     Enable the specified ADC interrupt.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     interrupt: Select the ADC interrupt sources
 *                       This parameter can be any combination of the following values:
 *                       @arg ADC_INT_EOC: End of conversion interrupt mask
 *                       @arg ADC_INT_AWD: Analog watchdog interrupt mask
 *                       @arg ADC_INT_INJEOC: End of injected conversion interrupt mask
 *                       @arg ADC_INT_OVR: Overrun interrupt enable
 *
 * @retval    None
 */
void ADC_EnableInterrupt(ADC_T *adc, uint32_t interrupt)
{
    adc->CTRL1 |= interrupt;
}

/*!
 * @brief     Disables the specified ADC interrupt.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     interrupt: Select the ADC interrupt sources
 *                       This parameter can be any combination of the following values:
 *                       @arg ADC_INT_EOC: End of conversion interrupt mask
 *                       @arg ADC_INT_AWD: Analog watchdog interrupt mask
 *                       @arg ADC_INT_INJEOC: End of injected conversion interrupt mask
 *                       @arg ADC_INT_OVR: Overrun interrupt enable
 *
 * @retval    None
 */
void ADC_DisableInterrupt(ADC_T *adc, uint32_t interrupt)
{
    adc->CTRL1 &= (uint32_t)~interrupt;
}

/*!
 * @brief     Reads the pending ADC flag
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     flag: Select the flag to check
 *                  This parameter can be one of the following values:
 *                  @arg ADC_FLAG_AWD: Analog watchdog flag
 *                  @arg ADC_FLAG_EOC: End of conversion flag
 *                  @arg ADC_FLAG_INJEOC: End of injected group conversion flag
 *                  @arg ADC_FLAG_INJCS: Start of injected group conversion flag
 *                  @arg ADC_FLAG_REGCS: Start of regular group conversion flag
 *                  @arg ADC_FLAG_OVR: Overrun flag
 *
 * @retval    SET or RESET
 */
uint8_t ADC_ReadStatusFlag(ADC_T *adc, ADC_FLAG_T flag)
{
    return (adc->STS & flag) ? SET : RESET;
}

/*!
 * @brief     Clears the pending ADC flag
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     flag: Select the flag to check
 *                  This parameter can be one of the following values:
 *                  @arg ADC_FLAG_AWD: Analog watchdog flag
 *                  @arg ADC_FLAG_EOC: End of conversion flag
 *                  @arg ADC_FLAG_INJEOC: End of injected group conversion flag
 *                  @arg ADC_FLAG_INJCS: Start of injected group conversion flag
 *                  @arg ADC_FLAG_REGCS: Start of regular group conversion flag
 *                  @arg ADC_FLAG_OVR: Overrun flag
 *
 * @retval    None
 */
void ADC_ClearStatusFlag(ADC_T *adc, uint32_t flag)
{
    adc->STS = ~(uint32_t)flag;
}

/*!
 * @brief     Reads the specified ADC Interrupt flag.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     flag: Select the ADC interrupt source.
 *                  This parameter can be one of the following values:
 *                  @arg ADC_INT_FLAG_EOC: End of conversion interrupt flag
 *                  @arg ADC_INT_FLAG_AWD: Analog watchdog interrupt flag
 *                  @arg ADC_INT_FLAG_INJEOC: End of injected conversion interrupt flag
 *                  @arg ADC_INT_FLAG_OVR: Overrun interrupt flag
 *
 * @retval    SET or RESET
 */
uint16_t ADC_ReadIntFlag(ADC_T *adc, ADC_INT_FLAG_T flag)
{
    uint32_t itmask = 0;
    uint32_t intStatus = 0;

    itmask = (uint32_t)1 << (flag >> 8);
    intStatus = adc->CTRL1 & itmask;

    if (((adc->STS & (uint32_t)(flag & 0x3F)) != (uint32_t)RESET) && intStatus)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/*!
 * @brief     Clears the specified ADC Interrupt pending bits.
 *
 * @param     adc: Select ADCx where x can be 1, 2 or 3.
 *
 * @param     flag: Select the ADC interrupt source.
 *                  This parameter can be any combination of the following values:
 *                  @arg ADC_INT_FLAG_EOC: End of conversion interrupt flag
 *                  @arg ADC_INT_FLAG_AWD: Analog watchdog interrupt flag
 *                  @arg ADC_INT_FLAG_INJEOC: End of injected conversion interrupt flag
 *                  @arg ADC_INT_FLAG_OVR: Overrun interrupt flag
 *
 * @retval    None
 */
void ADC_ClearIntFlag(ADC_T *adc, uint32_t flag)
{
    adc->STS = ~(uint32_t)(flag & 0x3F);
}

/**@} end of group ADC_Functions */
/**@} end of group ADC_Driver */
/**@} end of group APM32F4xx_StdPeriphDriver */
